IDENTIFICATION DIVISION.
PROGRAM-ID. INOUT.

ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
      SELECT IN-FILE ASSIGN TO 'in.txt'
        ORGANIZATION IS LINE SEQUENTIAL
        STATUS IN-FILE-STATUS.
      SELECT OUT-FILE ASSIGN TO 'out.txt'
        ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
  FILE SECTION.
     FD IN-FILE.
      01 IN-FILE-REC PIC X(20).
     FD OUT-FILE.
      01 OUT-FILE-REC PIC 99.
  WORKING-STORAGE SECTION.
    01 LINE-COUNT PIC 99 VALUE 0.
    01 IN-FILE-STATUS PIC XX.

PROCEDURE DIVISION.
  MAIN SECTION.
    OPEN INPUT IN-FILE.
    PERFORM UNTIL IN-FILE-STATUS NOT = "00"
      READ IN-FILE
        AT END
          DISPLAY "--END--"
        NOT AT END
          DISPLAY "CONTENT: " IN-FILE-REC
      END-READ
    END-PERFORM.
    CLOSE IN-FILE.

    OPEN OUTPUT OUT-FILE.
    PERFORM 10 TIMES
      ADD 1 TO LINE-COUNT
      MOVE LINE-COUNT TO OUT-FILE-REC
      WRITE OUT-FILE-REC
      DISPLAY OUT-FILE-REC
    END-PERFORM.

    CLOSE OUT-FILE.
    STOP RUN.
